app/Controllers/Kriteria.php

SELECT *
FROM `kriteria`
---
    public function table() {
        $data = [
            'title' => 'Data Kriteria',
            'url'   => $this->url,
            'table' => $this->table,
            'dataKriteria' => $this->kriteriaModel->findAll(),