app/Controllers/Penduduk.php

SELECT *
FROM `penduduk`
---
    public function table() {
        $data = [
            'title' => 'Data Penduduk',
            'url'   => $this->url,
            'pendudukData' => $this->pendudukModel->findAll(),
        ];