app/Controllers/Perhitungan.php

    public function __construct() {
        $this->kriteriaModel = new KriteriaModel();
        $this->pendudukModel = new PendudukModel();
        $this->subkriteriaModel = new SubkriteriaModel();
        $this->bltModel = new BltModel();

        $this->jumlahKriteria = $this->kriteriaModel->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `kriteria`

    public function index() {
        $this->totalNilaiKriteria = $this->kriteriaModel->selectSum('nilai')->first()['nilai'];

        $data = [
            'title' => 'Data Perhitungan dan Table Moora',
            'dataKriteria' => $this->kriteriaModel->findAll(),
            'totalNilaiKriteria' => $this->totalNilaiKriteria,
            'dataPeserta' => $this->bltModel->findAllDataBlt(),
            'dataSubkriteria' => $this->subkriteriaModel->findAll(),
---
SELECT SUM(`nilai`) AS `nilai`
FROM `kriteria`
 LIMIT 1
SELECT *
FROM `kriteria`
SELECT *
FROM `subkriteria`