app/Controllers/Peserta.php

    public function __construct() {
        $this->kriteriaModel = new KriteriaModel();
        $this->pendudukModel = new PendudukModel();
        $this->subkriteriaModel = new SubkriteriaModel();
        $this->pesertaModel = new PesertaModel();
        $this->jumlahKriteria = $this->kriteriaModel->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `kriteria`

    public function tambah() {
        $data = [
            'title' => 'Tambah Data Peserta',
            'url'   => $this->url,
            'dataPenduduk' => $this->pendudukModel->findAllNonBantuan(),
            'dataKriteria' => $this->kriteriaModel->findAll(),
            'dataSubkriteria' => $this->subkriteriaModel->findAll(),
---
SELECT *
FROM `kriteria`
SELECT *
FROM `subkriteria`

    public function table() {
        $data = [
            'title' => 'Data Peserta',
            'url'   => $this->url,
            'dataKriteria' => $this->kriteriaModel->findAll(),
            'dataPenduduk' => $this->pendudukModel->findAll(),
---
SELECT *
FROM `kriteria`
SELECT *
FROM `penduduk`

    public function add() {
        $data = $this->request->getPost();
        $this->pesertaModel->save($data);
---
INSERT INTO `peserta` (`id_penduduk`, `k_1`, `k_2`, `k_3`, `k_4`, `k_5`, `k_6`) VALUES ('3', '11', '12', '4', '9', '15', '16')