app/Controllers/Subkriteria.php

SELECT *
FROM `kriteria`
---
    public function tambah() {
        $data = [
            'title' => 'Tambah Data Kriteria',
            'kriteriaData' => $this->kriteriaModel->findAll(),

SELECT *
FROM `kriteria`
---
    public function table() {
        $data = [
            'title' => 'Data Kriteria',
            'url'   => $this->url,
            'dataSubkriteria' => $this->subkriteriaModel->findAllSubkriteria(),
            'dataKriteria' => $this->kriteriaModel->findAll(),

SELECT *
FROM `subkriteria`
WHERE `subkriteria`.`id` = '4'
SELECT *
FROM `kriteria`
---
    public function edit($id) {
        $data = [
            'title' => 'Edit Data Penduduk',
            'data'  => $this->subkriteriaModel->find($id),
            'dataKriteria' => $this->kriteriaModel->findAll(),

INSERT INTO `subkriteria` (`id_kriteria`, `subkriteria`, `nilai`) VALUES ('6', 'Ya', '5')
---
    public function add() {
        $data = $this->request->getPost();
        $this->subkriteriaModel->save($data);

UPDATE `subkriteria` SET `id_kriteria` = '4', `subkriteria` = '1 orang', `nilai` = '1'
WHERE `subkriteria`.`id` IN ('7')
---
    public function save($id) {
        $data = $this->request->getPost();
        $this->subkriteriaModel->update($id, $data);

DELETE FROM `subkriteria`
WHERE `id` IN ('12')
---
    public function delete($id) {

        $this->subkriteriaModel->delete($id);