app/Controllers/User.php

    public function index() {

        $data = [
            'title' => 'Data User',
            'url'   => $this->url,
            'userData' => $this->userModel->findAll(),
---
SELECT *
FROM `user`

    public function table() {
        $data = [
            'title' => 'Data User',
            'url'   => $this->url,
            'userData' => $this->userModel->findAll(),
        ];
---
SELECT *
FROM `user`